Config/Documents/SetRoomQuota.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>SetRoomQuota</Name>
			<BasedOn>
				<xr:Item>Catalog.RoomQuotas</xr:Item>
				<xr:Item>Document.SetRoomQuota</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.RoomQuotaSales</xr:Item>
				<xr:Item>AccumulationRegister.SalesForecast</xr:Item>
				<xr:Item>AccumulationRegister.ExpectedGuestGroups</xr:Item>
				<xr:Item>AccumulationRegister.RoomInventory</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ParentDoc</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SetRoomQuota</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomQuota</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomQuotas</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseRoomQuota</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomQuotas</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SetRoomQuotaType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SetRoomQuotaTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfRooms</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfBeds</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfBedsPerRoom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfPersonsPerRoom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsInitial</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForecast</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/Rooms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Rooms</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Hotels</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Floor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfBedsPerRoom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfPersonsPerRoom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationEndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomStatus</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HasRoomBlocks</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StopSale</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UsePassCode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TVCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsUseTVInterface</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsUseYandexInterface</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoorLockSystemAuthorization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DoorLockSystemAuthorizations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SecurityCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsVirtual</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomPropertiesDescriptions</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomPropertiesCodes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotShowRoomGuestTotals</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Photo1</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Photo2</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BoardPlace</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Resources</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoorLockSystemType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DoorLockSystems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>YandexCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BedsSetup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BedsSetups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BedsSetupIsFixed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>StopSalePeriods</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PeriodFrom</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PeriodTo</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Remarks</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StopSale</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CreateDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Author</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ConnectedRooms</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RoomType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Room</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/SetRoomQuota/Forms/tcListForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;

	// Let's set the properties of the form
	tcProtection.SetFormProperties(ThisObject);
	
	If not Parameters.Filter.Property("Hotel") Then
		SelHotel = SessionParameters.CurrentHotel;
		
		vArray = New Array;
		vArray.Add(SelHotel);		
		vArray.Add(Catalogs.Hotels.EmptyRef());		
		Parameters.Filter.Insert("Hotel",vArray);
	EndIf;
	
	If Parameters.Property("RoomQuota") Then
		SelRoomQuota = Parameters.RoomQuota;
		SelRoomQuotaOnChangeAtServer();
	EndIf;
	If Parameters.Property("SelEmployee") Then
		SelEmployee = Parameters.SelEmployee;
		SelEmployeeOnChangeAtServer();
	EndIf;
	If Parameters.Property("SelHistoryFrom") Then
		SelHistoryTo = Parameters.SelHistoryTo;
		SelHistoryFrom = Parameters.SelHistoryFrom;
		SelHistoryFromOnChangeAtServer();
	EndIf;
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure SelCustomerOnChange(Item)
	SelCustomerOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelAgentOnChange(Item)
	SelAgentOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelContractOnChange(Item)
	SelContractOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelRoomQuotaOnChange(Item)
	SelRoomQuotaOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelRoomTypeOnChange(Item)
	SelRoomTypeOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelRoomOnChange(Item)
	SelRoomOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelEmployeeOnChange(Item)
	SelEmployeeOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelRoomStartChoice(Item, ChoiceData, StandardProcessing)
	StandardProcessing = False;
	vParametrs = New Structure();
	vParametrs.Insert("ChoiceMode", True);
	If ValueIsFilled(SelRoomType) Then
		vParametrs.Insert("Filter", New Structure("RoomType", SelRoomType));
	EndIf;
	
	OpenForm("Catalog.Rooms.Form.tcListForm", vParametrs, Item);
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelDateFromOnChange(Item)
	SelDateFromOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelDateToOnChange(Item)
	SelDateToOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelHistoryFromOnChange(Item)
	SelHistoryFromOnChangeAtServer();
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure SelHistoryToOnChange(Item)
	SelHistoryFromOnChangeAtServer();
EndProcedure

#EndRegion 

#Region Private

// --------------------------------------------------------------------------------  
&AtServer
Procedure ClearingAttributeAtServer(pAttribute)
	vFilter =  List.Filter;
	vValue = New DataCompositionField(pAttribute);
	vDelList = New Array;
	For Each int In vFilter.Items Do
		If int.LeftValue = vValue Then
			vDelList.Add(int);			
		EndIf;	
	EndDo;
	For Each int In vDelList Do
		vFilter.Items.Delete(int);	
	EndDo;
EndProcedure

// --------------------------------------------------------------------------------  
&AtServer
Procedure AttributeChangeAtServer(pAttribute,pValue,pComparisonType = Undefined,pAddNew = False)
	vValue = pValue;	
	vComparisonType =  ?(pComparisonType = Undefined, DataCompositionComparisonType.Equal, pComparisonType);
	
	If ValueIsFilled(vValue) Then
		vFilter = List.Filter;
		vField = New DataCompositionField(pAttribute);
		
		If vFilter.Items.Count() = 0 Then	
			vFilterItem = vFilter.Items.Add(Type("DataCompositionFilterItem"));
			vFilterItem.LeftValue = vField;
			vFilterItem.ComparisonType = vComparisonType;
			vFilterItem.RightValue = vValue;
			vFilterItem.Use = True;
		Else
			If pAddNew Then
				vFilterItem = vFilter.Items.Add(Type("DataCompositionFilterItem"));
				vFilterItem.LeftValue      = vField;
				vFilterItem.ComparisonType = vComparisonType;
				vFilterItem.RightValue     = vValue;
				vFilterItem.Use            = True;
			Else
				// Find field
				vCancel = False;
				For Each int In  vFilter.Items Do
					If  int.LeftValue = vField  Then
						// Field delete
						vFilter.Items.Delete(int);	
						// Add a new
						vFilterItem = vFilter.Items.Add(Type("DataCompositionFilterItem"));
						vFilterItem.LeftValue      = vField;
						vFilterItem.ComparisonType = vComparisonType;
						vFilterItem.RightValue     = vValue;
						vFilterItem.Use            = True;
						vCancel                    = True;
						Break;
					EndIf;	
				EndDo;
				If Not vCancel Then
					// The field is not found, we add a new
					vFilterItem = vFilter.Items.Add(Type("DataCompositionFilterItem"));
					vFilterItem.LeftValue      = vField;
					vFilterItem.ComparisonType = vComparisonType;
					vFilterItem.RightValue     = vValue;
					vFilterItem.Use            = True;
				EndIf;
			EndIf;
		EndIf;
	EndIf;
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelCustomerOnChangeAtServer()
	If not ValueIsFilled(SelCustomer) Then
		ClearingAttributeAtServer("Customer");
	Else 
		AttributeChangeAtServer("Customer", SelCustomer);
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelAgentOnChangeAtServer()
	If not ValueIsFilled(SelAgent) Then
		ClearingAttributeAtServer("Agent");
	Else 
		AttributeChangeAtServer("Agent", SelAgent);
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelContractOnChangeAtServer()
	If not ValueIsFilled(SelContract) Then
		ClearingAttributeAtServer("Contract");
	Else 
		AttributeChangeAtServer("Contract", SelContract);
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelRoomQuotaOnChangeAtServer()
	If not ValueIsFilled(SelRoomQuota) Then
		ClearingAttributeAtServer("RoomQuota");
	Else 
		AttributeChangeAtServer("RoomQuota", SelRoomQuota);
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelRoomTypeOnChangeAtServer()
	If not ValueIsFilled(SelRoomType) Then
		ClearingAttributeAtServer("RoomType");
	Else 
		AttributeChangeAtServer("RoomType", SelRoomType);
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelRoomOnChangeAtServer()
	If not ValueIsFilled(SelRoom) Then
		ClearingAttributeAtServer("Room");
	Else 
		AttributeChangeAtServer("Room", SelRoom);
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelEmployeeOnChangeAtServer()
	If not ValueIsFilled(SelEmployee) Then
		ClearingAttributeAtServer("Author");
	Else 
		AttributeChangeAtServer("Author", SelEmployee);
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelDateFromOnChangeAtServer()	
	If ValueIsFilled(SelDateFrom) Then
		AttributeChangeAtServer("DateFrom", SelDateFrom, DataCompositionComparisonType.Greater);
	Else
		ClearingAttributeAtServer("DateFrom");	
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelDateToOnChangeAtServer()
	If ValueIsFilled(SelDateTo) Then	
		AttributeChangeAtServer("DateTo", EndOfDay(SelDateTo), DataCompositionComparisonType.Less);
	Else
		ClearingAttributeAtServer("DateTo");
	EndIf;	
EndProcedure

// --------------------------------------------------------------------------------
&AtServer
Procedure SelHistoryFromOnChangeAtServer()
	ClearingAttributeAtServer("Date");
	If ValueIsFilled(SelHistoryFrom) Then
		AttributeChangeAtServer("Date", SelHistoryFrom, DataCompositionComparisonType.GreaterOrEqual, True);
	EndIf;
	If ValueIsFilled(SelHistoryTo) Then
		AttributeChangeAtServer("Date", EndOfDay(SelHistoryTo), DataCompositionComparisonType.LessOrEqual, True);
	EndIf;
EndProcedure

#EndRegion
